{
  "currentVersion": "1.3.0",
  "updates": [
    {
      "version": "1.3.0",
      "title": "Sistema de notificaciones en tiempo real",
      "description": "Ahora recibirás notificaciones de tus logros, rachas, actualizaciones de ranking y nuevas funcionalidades. Mira la campanita en el header para estar al día.",
      "icon": "🔔",
      "date": "2025-11-28"
    },
    {
      "version": "1.2.0",
      "title": "La app ahora es mucho más rápida",
      "description": "Hemos mejorado la velocidad de carga en todas las páginas. Notarás la diferencia especialmente al abrir tu perfil y navegar entre asignaturas.",
      "icon": "⚡",
      "date": "2025-11-27"
    },
    {
      "version": "1.1.0",
      "title": "Tu cuenta está más protegida que nunca",
      "description": "Hemos reforzado la seguridad de la plataforma para proteger mejor tu información personal y tus datos de estudio.",
      "icon": "🔒",
      "date": "2025-11-26"
    },
    {
      "version": "1.0.5",
      "title": "Sistema de rachas de estudio",
      "description": "Mantén tu racha diaria estudiando y compite con otros usuarios en el ranking de rachas.",
      "icon": "🔥",
      "date": "2025-11-25"
    },
    {
      "version": "1.0.0",
      "title": "Lanzamiento de Quizy",
      "description": "Plataforma completa de cuestionarios educativos con soporte para múltiples niveles académicos.",
      "icon": "🎉",
      "date": "2025-11-01"
    }
  ],
  "hotfixes": [
    {
      "version": "1.2.0",
      "title": "La página de soporte ya no se congela",
      "description": "Arreglado un problema que hacía que la página se quedara cargando infinitamente.",
      "date": "2025-11-27"
    },
    {
      "version": "1.2.0",
      "title": "Tu perfil ahora carga mucho más rápido",
      "description": "Optimizamos la carga inicial, especialmente si tienes muchas asignaturas favoritas.",
      "date": "2025-11-27"
    },
    {
      "version": "1.1.5",
      "title": "Tus tickets de soporte ahora se ven correctamente",
      "description": "Solucionado un error que impedía ver tus consultas enviadas en la sección de soporte.",
      "date": "2025-11-26"
    },
    {
      "version": "1.1.2",
      "title": "Problema con tickets resuelto",
      "description": "Ya no aparece el mensaje de error al intentar ver tus tickets de soporte.",
      "date": "2025-11-26"
    },
    {
      "version": "1.1.0",
      "title": "No necesitas volver a iniciar sesión",
      "description": "Tu sesión ahora se mantiene activa correctamente después de las actualizaciones.",
      "date": "2025-11-26"
    }
  ]
}
